In [2]:
import pandas as pd
import numpy as np

## 数据合并
- concat合并数据
- merge合并数据

In [1]:
# concat([data1, data2], axis=1)
# 按照行或列进行合并

In [6]:
one = pd.DataFrame(np.ones((3, 5)))
zero = pd.DataFrame(np.zeros((3, 5)))

In [7]:
# 合并到行内
pd.concat([one, zero], axis=1)

     0    1    2    3    4    0    1    2    3    4
0  1.0  1.0  1.0  1.0  1.0  0.0  0.0  0.0  0.0  0.0
1  1.0  1.0  1.0  1.0  1.0  0.0  0.0  0.0  0.0  0.0
2  1.0  1.0  1.0  1.0  1.0  0.0  0.0  0.0  0.0  0.0

In [9]:
# 合并到列内
pd.concat([one, zero], axis=0)

     0    1    2    3    4
0  1.0  1.0  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0  1.0
0  0.0  0.0  0.0  0.0  0.0
1  0.0  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0  0.0

In [10]:
# merge(left, right, how='inner', on)
# how： left right outer inner 连接，对应mysql链表查询
# on 关联键

In [16]:
left = pd.DataFrame([
    [1, 1, 1, 2],
    [3, 3, 3, 2],
    [5, 5, 5, 1]
], columns=['a','b','c','d'])
right = pd.DataFrame([
    [2, 2, 2, 0],
    [4, 4, 4, 2],
    [6, 6, 6, 0]
], columns=['a','b','c','d'])

In [17]:
left

   a  b  c  d
0  1  1  1  2
1  3  3  3  2
2  5  5  5  1

In [18]:
right

   a  b  c  d
0  2  2  2  0
1  4  4  4  2
2  6  6  6  0

In [20]:
# 内连接，取交集，on=d
# 将d相等的数据进行合并
pd.merge(left, right, how='inner', on=['d'])

   a_x  b_x  c_x  d  a_y  b_y  c_y
0    1    1    1  2    4    4    4
1    3    3    3  2    4    4    4

In [22]:
# 外链接，取并集
pd.merge(left, right, how='outer', on=['d'])

   a_x  b_x  c_x  d  a_y  b_y  c_y
0  1.0  1.0  1.0  2  4.0  4.0  4.0
1  3.0  3.0  3.0  2  4.0  4.0  4.0
2  5.0  5.0  5.0  1  NaN  NaN  NaN
3  NaN  NaN  NaN  0  2.0  2.0  2.0
4  NaN  NaN  NaN  0  6.0  6.0  6.0

In [23]:
pd.merge(left, right, how='left', on=['d'])

   a_x  b_x  c_x  d  a_y  b_y  c_y
0    1    1    1  2  4.0  4.0  4.0
1    3    3    3  2  4.0  4.0  4.0
2    5    5    5  1  NaN  NaN  NaN

In [24]:
pd.merge(left, right, how='right', on=['d'])

   a_x  b_x  c_x  d  a_y  b_y  c_y
0  NaN  NaN  NaN  0    2    2    2
1  1.0  1.0  1.0  2    4    4    4
2  3.0  3.0  3.0  2    4    4    4
3  NaN  NaN  NaN  0    6    6    6